"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
age_student = 36 #вік студента, числовий тип даних int
name_student = "Ira" #ім'я студента, текстовий тип даних str
is_student = True #чи це студент? Значення true або false, тип даних bool
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name2 = "John" # назва змінної не може починатися із цифри
user_age = 25 # для розділення слів у назві змінної використовуємо нижнє підкреслення, а не дефіс
price = 100 # у назвах змінних не можна використовувати символи
classes = "Math" # class - це зарезервоване слово, а ці слова не можна використовувати у назвах змінних
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
max_students = 30

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
name_course = "Python"
count_hours = 100
cost_course = 20.000

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
costs_course = count_hours / cost_course

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""

decimal_number = 42
binary_number = 0b101010
hexadecimal_number = 0x2A
octal_number = 0o52


"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
a = 17
b = 5
result_1 = a + b
print ("Сумма чисел 17 і 5 дорівнює",result_1)

result_2 = a - b
print ("Різниця чисел 17 і 5 дорівнює",result_2)

result_3 = a*b
print ("Добуток 17 і 5 дорівнює",result_3)

result_4 = a / b
print (result_4) #повертає число із плаваючою точкою

result_5 = a // b
print (result_5) #цілочисельне ділення, повертає ціле число

result_6 = a % b
print (result_6) # повертає залишок від ділення

result_7 = a ** b
print (result_7) #піднесення до степеня



"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
radius = 7.5
pi = 3.14159

area = pi*radius**2
print (area)

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""

res_1 = 50 % 7
res_2 = 33 % 7
res_3 = 14 % 7

print (res_1)
print (res_2)
print (res_3)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea = 436402
asov_sea = 37800

area_seas = black_sea + asov_sea
print (area_seas)

"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
my_name = "Onofriichuk Iryna Yuriivna"

first_symbol = my_name[0]
print (first_symbol)

last_symbol = my_name[-1]
print (last_symbol)

length_my_name = len (my_name)
print (length_my_name)


"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
line_text ="Would you tell me, please, which way I ought to go from here?"

symbol_6 = line_text [0:6]
print (symbol_6)

len_text = len(line_text)

symbol_11 =line_text [len_text-11:len_text]
print (symbol_11)

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
my_poem = """ І все на світі треба пережити,
І кожен фініш - це, по суті, старт..."""


"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
words = "Hello","World"

ryadok_1 = " ".join(words)
print (ryadok_1)

ryadok_2 = ",".join(words)
print (ryadok_2)

ryadok_3 = "\n".join(words)
print (ryadok_3)


"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
text = "Вона сказала: \"Привіт!\" Я відповіла: \"Як справи?\" Чудовий день: \\"

print(text)

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
name_user = input("Введіть ваше ім'я")
age_user = input("Введіть ваш вік")

print("Привіт,",name_user + "!", "Тобі", age_user, "років.")

"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_photo = 232 #загальна кількість фото
page = 8 #кількість фото, яка вміщується на одну сторінку

count_page = total_photo // page #кількість сторінок, яка знадобиться, щоб вклеїти всі фото
print (count_page)


"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
color = input ("Введіть свій улюблений колір")
number = input ("Введіть ваше улюблене число")

print (f"Твій улюблений колір - {color}, твоє улюблене число - {number}")


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_count = 375291 #загальна кількість товару, що розміщена на трьох складах
sklad_1_and_2 = 250449 #кількість товару, що розміщена на першому та другому складі
sklad_2_and_3 = 222950 #кількість товару, що розміщена на другому та третьому складах

sklad_1 = total_count - sklad_2_and_3 #дізнаємося, яка кількість товару розміщена на першому складі
sklad_3 = total_count - sklad_1_and_2 #дізнаємося кількість товару, що розміщено на третьому складі
sklad_2 = total_count - (sklad_1 + sklad_3) #дізнаємося кількість товару, що розміщено на другому складі

print (sklad_1)
print (sklad_2)
print (sklad_3)


"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
count_month = 18 #кількість місяців, протягом який потрібно виплачувати кредит
cost_month = 1179 #вартість, яку потрібно виплачувати щомісяця
total_price = count_month * cost_month #вартість комп'ютера
print (total_price)
